[
    {
        "id": "blog_01",
        "tag": "Data Science",
        "title": "Building a Scalable Data Pipeline",
        "sub": "Data Engineering · 8 min read",
        "description": "Designing fault-tolerant ETL pipelines with Airflow, schema evolution, and production observability instrumentation.",
        "body": "A deep-dive into designing <span class='modal-highlight'>fault-tolerant</span> ETL pipelines using modern tooling. We explore orchestration with Airflow, schema evolution strategies, and how to instrument jobs for production observability.<br><br>Key topics covered: pipeline idempotency, backfill strategies, SLAs, and cost optimisation on cloud compute.",
        "img": "../assets/images/banner.png"
    },
    {
        "id": "blog_02",
        "tag": "Machine Learning",
        "title": "Demystifying Gradient Boosting",
        "sub": "ML Theory · 12 min read",
        "description": "From bias-variance tradeoff to XGBoost hyperparameter tuning — a practical guide to boosting ensembles.",
        "body": "From bias-variance tradeoff to <span class='modal-highlight'>XGBoost hyperparameter tuning</span>: a practical guide to understanding how boosting ensembles learn, where they fail, and how to debug your model step by step.",
        "img": "../assets/images/Data Science Inc.webp"
    },
    {
        "id": "blog_03",
        "tag": "Analytics",
        "title": "SQL Window Functions Explained",
        "sub": "Analytics · 6 min read",
        "description": "RANK, LAG, LEAD and NTILE with real-world business cases and annotated SQL examples.",
        "body": "Window functions like <span class='modal-highlight'>RANK, LAG, LEAD and NTILE</span> unlock powerful analytical queries without collapsing your result set. This post walks through real-world business cases with annotated SQL.",
        "img": "../assets/images/Simon Fraser University.png"
    },
    {
        "id": "blog_04",
        "tag": "Research",
        "title": "Reproducible Research with Python",
        "sub": "Research Methods · 9 min read",
        "description": "Structure projects with Cookiecutter, DVC, and MLflow for guaranteed reproducibility end-to-end.",
        "body": "Notebooks are great for exploration but terrible for collaboration. Learn how to structure your projects using <span class='modal-highlight'>Cookiecutter, DVC, and MLflow</span> to guarantee reproducibility from data ingestion to model artefacts.",
        "img": "../assets/images/Canadian Tire.png"
    },
    {
        "id": "blog_05",
        "tag": "Strategy",
        "title": "Data Strategy for Growing Startups",
        "sub": "Business · 7 min read",
        "description": "The minimal viable data stack that lets a 10-person startup move like a 100-person organisation.",
        "body": "When you don't have a data team yet, <span class='modal-highlight'>every decision compounds</span>. This post covers the minimal viable data stack — from event tracking to a first data warehouse — that lets a 10-person team move like a 100-person one.",
        "img": "../assets/images/Delhi Public School.avif"
    },
    {
        "id": "blog_06",
        "tag": "Visualisation",
        "title": "Data Storytelling with Python",
        "sub": "Visualisation · 10 min read",
        "description": "Applying Gestalt principles and narrative structure to build executive-ready data visualisations.",
        "body": "Charts lie when we let them. Learn how to choose the right visualisation type, apply <span class='modal-highlight'>Gestalt principles</span> for pre-attentive processing, and craft a clear narrative that an executive can act on in under 30 seconds.",
        "img": "../assets/images/banner.png"
    },
    {
        "id": "blog_07",
        "tag": "ML Ops",
        "title": "CI/CD for Machine Learning Models",
        "sub": "ML Ops · 11 min read",
        "description": "Model versioning, shadow deployments, canary rollouts, and automated performance regression tests.",
        "body": "Deploying a model once is easy. <span class='modal-highlight'>Maintaining it over 12 months is not</span>. This guide covers model versioning, shadow deployments, canary rollouts, and automated performance regression tests.",
        "img": "../assets/images/Data Science Inc.webp"
    },
    {
        "id": "blog_08",
        "tag": "Statistics",
        "title": "Causal Inference for Analysts",
        "sub": "Statistics · 14 min read",
        "description": "DiD, IV, and RD designs that let you draw causal conclusions from observational data.",
        "body": "Correlation is not causation — but sometimes we need to act as if it is. Learn how <span class='modal-highlight'>Difference-in-Differences, Instrumental Variables, and Regression Discontinuity</span> let you draw causal conclusions from observational data.",
        "img": "../assets/images/Simon Fraser University.png"
    },
    {
        "id": "blog_09",
        "tag": "Career",
        "title": "Breaking into Data Science in 2025",
        "sub": "Career · 5 min read",
        "description": "What hiring managers actually look for: production code, communication, and domain fluency.",
        "body": "The market has shifted. <span class='modal-highlight'>Generalist roles are down; specialised roles are up.</span> This post distills what hiring managers actually look for: production code, communication skills, and domain fluency — not just model accuracy on Kaggle.",
        "img": "../assets/images/Linkedin Headshot.jpeg"
    },
    {
        "id": "blog_10",
        "tag": "Tools",
        "title": "dbt: The Analyst's Best Friend",
        "sub": "Tools · 8 min read",
        "description": "Version-controlled models, automated tests, and lineage graphs — from ad-hoc SQL to collaborative data modelling.",
        "body": "dbt turns SQL into a <span class='modal-highlight'>software engineering practice</span>: version-controlled models, automated testing, lineage graphs, and self-documenting warehouses. A practical walkthrough for analysts moving from ad-hoc queries to collaborative data modelling.",
        "img": "../assets/images/Canadian Tire.png"
    }
]